app/Models/Utilisateur.php

INSERT INTO "utilisateur" ("matricule", "nom", "prenom", "email") VALUES ('ET001', 'Rakoto', 'Jean', 'jean@test.mg')
---
    public function import($full_data)
    {
        $db = \Config\Database::connect();
        $liste_tables = $this->getAlltables();
        var_dump($liste_tables);

        foreach ($liste_tables as $table_row) {
            $table = $table_row['table_name'];

            $data_selectionne_par_table = $this->getDataColomnesValides($full_data, $table);
            if (!empty($data_selectionne_par_table)) {
                $db->table($table)->insert($data_selectionne_par_table);